emacs/offline-doc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-26 四 14:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>离线文档工具</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">离线文档工具</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org60ea54d">1. 概述</a></li>
<li><a href="#org689d8f4">2. dash</a></li>
<li><a href="#org102a680">3. zeal</a></li>
<li><a href="#orgd98ed5c">4. devdocs</a></li>
<li><a href="#orgc47f84d">5. Velocity</a></li>
<li><a href="#orgb1d1b3d">6. LovelyDocs</a></li>
<li><a href="#org2c65a76">7. Emacs 扩展</a>
<ul>
<li><a href="#org69836d8">7.1. dash-at-point</a></li>
<li><a href="#orgf5eb496">7.2. helm-dash</a></li>
<li><a href="#org2fd766e">7.3. zeal-at-point</a></li>
<li><a href="#org06df30b">7.4. 总结</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org60ea54d" class="outline-2">
<h2 id="org60ea54d"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
程序员开发过程中经常需要查询各种文档，不同语言，不同代码库或者工具需要登录不同的网站，比较繁琐，如果能有一个工具集中查询会比较好。下面介绍几款这样的工具：
</p>
</div>
</div>

<div id="outline-container-org689d8f4" class="outline-2">
<h2 id="org689d8f4"><span class="section-number-2">2</span> dash</h2>
<div class="outline-text-2" id="text-2">
<p>
Dash 是一个 API 文档浏览器（API Documentation Browser），以及代码片段管理工具（Code Snippet Manager）。但是该软件只支持 MacOS。
</p>
</div>
</div>


<div id="outline-container-org102a680" class="outline-2">
<h2 id="org102a680"><span class="section-number-2">3</span> zeal</h2>
<div class="outline-text-2" id="text-3">
<p>
是一个跨平台工具，没有代码片段功能。
</p>
</div>
</div>

<div id="outline-container-orgd98ed5c" class="outline-2">
<h2 id="orgd98ed5c"><span class="section-number-2">4</span> devdocs</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://devdocs.io/">devdocs</a> 搜索功能不如 zeal。
</p>
</div>
</div>

<div id="outline-container-orgc47f84d" class="outline-2">
<h2 id="orgc47f84d"><span class="section-number-2">5</span> Velocity</h2>
<div class="outline-text-2" id="text-5">
<p>
Windows 平台工具
</p>
</div>
</div>

<div id="outline-container-orgb1d1b3d" class="outline-2">
<h2 id="orgb1d1b3d"><span class="section-number-2">6</span> LovelyDocs</h2>
<div class="outline-text-2" id="text-6">
<p>
Android 平台工具。
</p>
</div>
</div>

<div id="outline-container-org2c65a76" class="outline-2">
<h2 id="org2c65a76"><span class="section-number-2">7</span> Emacs 扩展</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org69836d8" class="outline-3">
<h3 id="org69836d8"><span class="section-number-3">7.1</span> dash-at-point</h3>
<div class="outline-text-3" id="text-7-1">
<p>
要求安装 dash。
</p>
</div>
</div>

<div id="outline-container-orgf5eb496" class="outline-3">
<h3 id="orgf5eb496"><span class="section-number-3">7.2</span> helm-dash</h3>
<div class="outline-text-3" id="text-7-2">
<p>
参见 <a href="modes/helm-dash.html">helm-dash 实践</a>
</p>
</div>
</div>

<div id="outline-container-org2fd766e" class="outline-3">
<h3 id="org2fd766e"><span class="section-number-3">7.3</span> zeal-at-point</h3>
<div class="outline-text-3" id="text-7-3">
<p>
参见<a href="modes/zeal-at-point.html">zeal-at-point</a> 实践
</p>
</div>
</div>

<div id="outline-container-org06df30b" class="outline-3">
<h3 id="org06df30b"><span class="section-number-3">7.4</span> 总结</h3>
<div class="outline-text-3" id="text-7-4">
<p>
使用过程中发现，zeal 下载文档更方便，可以选中多个 docsets 同时下载。zeal-at-point 打开 zeal 速度也要比 helm-dash 在浏览器文档要快，推荐使用 zeal-at-point。
</p>

<p>
但如果想使用 eww 展示 api，则需要 helm-dash。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-26 四 14:34</p>
<p class="validation"></p>
</div>
</body>
</html>
